import { Injectable } from '@angular/core';
// import * as data from '../shared/experiments.json';


@Injectable({
  providedIn: 'root'
})
export class DataService {

  //   stages: any[] = [
  //     { name: "المرحلة الابتدائية" , stage: 'primary',
  //       material: [
  //         'تجارب الكيمياء',
  //         'تجارب الفيزياء',
  //         'تجارب الاحياء'
  //       ]
  //     },
  //     { name: "المرحلة الاعدادية" , stage: 'middle',
  //       material: [
  //         'تجارب الكيمياء',
  //         '11111تجارب الفيزياء',
  //         'تجارب الاحياء'
  //       ]
  //     },
  //     { name: "المرحلة الثانوية" , stage: 'secondary',
  //       material: [
  //         '22222222تجارب الكيمياء',
  //         'تجارب الفيزياء',
  //         'تجارب الاحياء'
  //       ]
  //     }
  //   ]

  data = [
    {
      "id": 1,
      "name": "تجربة الصوديوم",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوز تكتشف خصائص الفلزات، وعندنا 3 أنواع من الفلزات، وهما الصوديوم، والبوتاسيوم، والحديد",
        "عاوزينك تكتشف تفاعلهم مع المواد المحيطة في معملك زي الماء. وليه بنستخدم الكيروسين مع بعض العناصر؟",
        "وعاوزينك تكتشف هل هتطفو المعادن دي ولا هتغوص في الماء؟",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ],
      "tools": ["فلز الصوديوم", " فلز البوتاسيوم", "فلز الحديد", "مخبار به ماء", "مخبار به كيروسين"
      ],
      "steps": [
        "قم بسحب الصوديوم أو البوتاسيوم أو الحديد",
        "ضع في الكيروسين أي من السيقان الثلاثة",
        "شاهد التفاعل الذي يحدث بوضع كل ساق في الكيروسين",
        "قم بسحب الصوديوم وضعه في الماء",
        "قم بسحب البوتاسيوم ثم ضعه في الماء",
        "قم بسحب قطعة الحديد ثم ضعها في مخبار الماء أو الكيروسين"
      ],
      "conclusion": [
        "أن الصوديوم والبوتاسيوم من الفلزات النشطة إللي بتتفاعل بقوة مع الماء مسببة انفجار كبير، عشان كدا يجب حفظها في الكيروسين عشان ماتسببش خطر",
        ".كثافة الصوديوم والبوتاسيوم أقل من الماء، عشان كدا بيطفو فوق سطح الماء",
        ".كثافة الحديد أعلى من الماء عشان كدا بتغوص قطعة الحديد في المخبار"
      ],
      "img": "assets/main/exp1.png",
      "exp": "exp1"
    }
    ,
    {
      "id": 2,
      "name": "الماء مذيب قطبي",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوز تكتشف أن الماء مذيب قطبي، وعندنا سكر مائدة، وملح طعام، وزيت طعام للمساعدة في التعرف على دا",
        "ودلوقتي عاوزينك تكتشف تفاعلهم مع الماء وايه منهم هيدوب في الماء وايه منهم هيطفو على سطح الماء من غير ما يذوب",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ],
      "tools": [
        "سكر مائدة",
        "ملح طعام",
        "زيت طعام",
        "3 كؤوس",
        "ملعقة"
      ],
      "steps": [
        "أملأ الكؤوس الثلاثة بالماء من الصنبور",
        "ضع في الكأس الأول ملعقة من سكر المائدة",
        "ضع في الكأس  الثاني ملعقة من ملح الطعام",
        "ضع في  الكأس الثالث قطرات من زيت الطعام",
        "قلب محتويات الكؤوس الثلاثة",
        "اكتشف تفاعلهم مع الماء وأي منهم سيذوب في الماء وأي منهم سيطفو على سطح الماء دون أن يذوب"
      ],

      "conclusion": [
        ".أن بعض المواد تدوب في الماء، وبعضها مش بيدوب فيه زي الزيت",
        ".لماء مذيب قطبي جيد لمعظم المركبات الأيونية (زي ملح الطعام) ولبعض المركبات التساهمية (زي سكر المائدة) إللي يكون معها روابط هيدروجينية",
      ],
      "img": "assets/main/exp3.png",
      "exp": "exp2"
    },
    {
      "id": 3,
      "name": "عناصر التوصيل الكهربائي",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك تكتشف ايه من العناصر جيدة التوصيل للكهرباء وايه منها مش جيدة للكهرباء",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مصباح كهربي",
        "بطارية",
        "مفتاح",
        "قطعة رصاص",
        "قطعة بلاستيك",
        "قطعة ألمنيوم",
        "قطعة خشب"
      ],
      "steps": [
        "قم بسحب الأدوات إلى مكان إجراء التجربة ",
        " قم بتوصيل المصباح الكهربي والبطارية مع كل من قطعة الرصاص والألمونيوم والحديد وانظر ما سيحدث",
        "قم بتوصيل المصباح الكهربي والبطارية مع كل من قطعة الخشب والبلاستيك وانظر ما سيحدث."
      ],
      "conclusion": [
        ".أن الحديد والألمونيوم والرصاص من المواد جيدة التوصيل للكهرباء",
        ".أن الخشب والبلاستيك من المواد رديئة التوصيل للكهرباء",
      ],
      "img": "assets/main/exp2.png",
      "exp": "exp3"
    }
    ,
    {
      "id": 4,
      "name": "اختلاف المواد في توصيلها للحرارة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك تتعرف على اختلاف درجات المواد في توصيلها للحرارة",
        "عشان كدا عاوزينك تجهز سيقان متساوية تقريبًا في الطول والسمك، من الألومنيوم، والخشب، والحديد، والبلاستيك",
        "عشان تتعرف على درجات اختلاف المواد دي في التوصيل للحرارة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "لهب",
        "كأس به ماء",
        "ساق الومنيوم",
        "ساق خشب",
        "ساق حديد",
        "ساق بلاستيك"
      ],
      "steps": [
        "جهز عدة سيقان متساوية تقريبًا في الطول والسمك",
        "ضع الكأس الذي به ماء فوق اللهب",
        "قم بتسخين الماء",
        "ضع في الماء السيقان الثلاثة",
        "امسك ساق الحديد أو الألومنيوم من طرفها",
        "كرر هذه الخطوة مع السيقان الأخرى (ساق البلاستيك وساق الخشب)"
      ],
      "conclusion": [
        ".تختلف المواد في درجات توصيلها للحرارة، فالخشب والبلاستيك من المواد رديئة التوصيل للحرارة لكن النحاس والألومينيوم من المواد جيدة التوصيل للحرارة",
      ],
      "img": "assets/main/exp4.png",
      "exp": "exp4"
    }
    ,
    {
      "id": 5,
      "name": "تحضير غاز الأكسجين في المعمل",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوز تحضر غاز الأكسجين في المعمل دا بتكوينك للجهاز إللي قدامك",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "دورق زجاجي",
        "سدادة من الفلين ذات ثقبين",
        "أنبوبة زجاجية",
        "حوض",
        "عدة مخابير زجاجية",
        "ماء",
        "محلول فوق أكسيد الهيدروجين",
        "ثاني أكسيد المنجنيز",
        "قمع زجاجي ذو صنبور"
      ],
      "steps": [
        "ضع كمية من ثاني أكسيد المنجنيز في الدورق",
        "املأ القمع بفوق أكسيد الهيدروجين",
        "افتح الصنبور لتسمح بنزول كمية قليلة من فوق أكسيد الهيدروجين على ثاني أكسيد المنجنيز",
        "اغلق الصنبور عندما يمتلئ المخبار بالغاز",
        "اغلق فوهة المخبار وارفعه من الحوض",
        "كرر هذه الخطوات لتقوم بملء عدة مخابير لاختبار خواص غاز الأكسجين",
      ],
      "conclusion": [
        ".يتحلل غاز فوق أكسيد الهيدروجين بمساعدة ثاني أكسيد المنجنيز وينتج عن دا ماء وأكسجين",
        ".سيتم جمع الأكسجين فوق سطح الماء لأنه شحيح الذوبان في الماء",
        ".ويرجع إضافة ثاني أكسيد المنجنيز لأنه بيزود من سرعة التفاعل من غير ما يتغير أو يؤثر على النواتج عشان كدا معروف بالعامل المساعد أو العامل الحفاز"
      ],
      "img": "assets/main/exp5.png",
      "exp": "exp5"
    }
    ,
    {
      "id": 6,
      "name": "الكشف عن غاز ثاني أكسيد الكربون",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوز تكشف عن وجود غاز ثاني أكسيد الكربون",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مخبار زجاجي",
        "شمعة",
        "ماء جير رائق",
        "غطاء زجاجي"
      ],
      "steps": [
        "قم بتثبيت الشمعة في المخبار الزجاجي واشعلها",
        "غطها بغطاء زجاجي ولاحظها حتى تنطفئ",
        "ارفع غطاء المخبار وصُب بداخله قليلاً من ماء الجير الرائق"
      ],
      "conclusion": [
        ".ينتج من انطفاء الشمعة غاز ثاني أكسيد الكربون",
        ".يتعكر ماء الجير الرائق إذا مررنا به غاز ثاني أكسيد الكربون",
        ".مكن الاستدلال على وجود غاز ثاني أكسيد الكربون من خلال ماء الجير الرائق لما يتعكر"
      ],
      "img": "assets/main/exp6.png",
      "exp": "exp6"
    }
    ,
    {
      "id": 7,
      "name": "فصل مخلوط من مواد صلبة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوز تفصل مخلوط من المواد الصلبة",
        "استخدم المغناطيس لفصل المكونات دي عن بعضها",
        "حط الرمل على برادة الحديد في الإناء وبعدين اخلط المكونات مع بعض وبعدين استخدم المغناطيس لفصل المكونات دي عن بعضها",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "إناء",
        "برادة حديد",
        "رمل",
        "مغناطيس"
      ],
      "steps": [
        "الخطوة الأولى: ضع الرمل على برادة الحديد في الإناء",
        "الخطوة الثانية: اخلط المكونات معًا",
        "الخطوة الثالثة: استخدم المغناطيس لفصل هذه المكونات عن بعضها"
      ],
      "conclusion": [
        ".يمكن فصل مخلوط من المواد الصلبة باستخدام المغناطيس حيث يلتقط المغناطيس برادة الحديد",
      ],
      "img": "assets/main/exp7.png",
      "exp": "exp7"
    },
    {
      "id": 8,
      "name": "فصل مخلوط من المواد الصلبة والسائلة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوز تفصل مخلوط من المواد الصلبة والسائلة",
        "والمواد الصلبة زي الملح والرمل والمواد السائلة زي الماء",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ملح",
        "رمل",
        "ماء",
        "قمع",
        "ورقة ترشيح",
        "كأسين",
        "لهب",
        "حامل"
      ],
      "steps": [
        " كون خليط من الملح والرمل والماء في كأس عن طريق التقليب",
        " ضع ورقة الترشيح داخل القمع وثبته على الحامل",
        " ضع الكأس أسفل القمع",
        " صب محتويات الكأس الأول داخل القمع فيبقى في الكأس الذي بأسفل القمع محلول الماء والملح، ويبقي في القمع الرمل فقط",
        " قم بتسخين محلول الملح فيتبخر الماء ويتبقى الملح فقط"
      ],
      "conclusion": [
        ".يمكن فصل المحلول الملحي عن المواد الصلبة عن طريق قمع الترشيح",
        ".كمان يمكن فصل المادة المذابة في الماء عن طريق التسخين هتتبخر الماء ويبقى المادة المذابة سواء سكر او ملح",
      ],
      "img": "assets/main/exp8.png",
      "exp": "exp8"
    }
    ,
    {
      "id": 9,
      "name": "المغناطيسية باستخدام الكهرباء",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك تتعرف على المغناطيسية باستخدام الكهرباء",
        "أختبر مغناطيسية المسمار في حالة إذا كان متصل بالكهرباء وفي حالة إذا كان مش متصل بالكهرباء و دا بتقريبه من مجموعة مشابك الورق في الحالتين",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مسمار طويل من الحديد المطاوع",
        "سلك نحاسي",
        "معزول طوله 30 سم",
        "مجموعة من مشابك الورق المعدنية",
        "بطارية (حجر طورش)"
      ],
      "steps": [
        "احضر مسمارًا طويلاً من الحديد المطاوع وقربه من مجموعة من مشابك الورق المعدنية",
        "احضر حوالي 30 سم من سلك نحاسي معزول ثم لف السلك حول المسمار بشكل منتظم",
        "انزع حوالي 2 سم من المادة العازلة في طرفي السلك",
        "وصل طرفي السلك بقطبي بطارية لكي يمر التيار الكهربي في السلك الملفوف حول المسمار",
        "اختبر مغناطيسية المسمار في هذه الحالة بتقريبه من مجموعة مشابك الورق",
        "افصل التيار الكهربي وذلك بإبعاد البطارية واختبر مغناطيسية المسمار في هذه الحالة",
      ],
      "conclusion": [
        ".يمكن زيادة قوة المغناطيس بزيادة عدد لفات الملف أو بزيادة شدة التيار الكهربي",
      ],
      "img": "assets/main/exp9.png",
      "exp": "exp9"
    },
    {
      "id": 10,
      "name": "تأثير كمية المذيب في الذوبان",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك أن تكتشف تأثير كمية المذيب في الذوبان، سواء كانت كمية المذيب كبيرة أم صغيرة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "كأسان",
        "ماء",
        "ملعقة",
        "سكر",
        "ساعة إيقاف"
      ],
      "steps": [
        "ضع ملعقة من السكر وكمية 150 مللي من الماء في كأس",
        "ضع ملعقة سكر أخرى في كمية 300 مللي من الماء لتكوين محلول سكري",
        "قلب كل محلول واحسب الزمن اللازم للذوبان في الحالتين"
      ],
      "conclusion": [
        ".كلما ازدادت كمية المذيب مع ثبات كمية المذاب أدى دا لسرعة ذوبان المذيب بشكل أسرع عم ما لو تم إذابته في كمية أقل من المذيب",
      ],
      "img": "assets/main/exp10.png",
      "exp": "exp10"
    }
    ,
    {
      "id": 11,
      "name": "تكوين كلوريد الأمونيوم (السحب البيضاء)",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح طريقة تكوين كلوريد الأمونيوم (ايه السُحب البيضاء)",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "حامل",
        "مخبار",
        "ساق زجاجية",
        "محلول الأمونيا",
        "مخبار به حمض هيدروليك مركز"
      ],
      "steps": [
        "ضع محلول الأمونيا في المخبار",
        "ضع المخبار على الحامل",
        "ضع الساق الزجاجية في المخبار الذي به حمض الهيدروليك المركز",
        "قرب الساق المبلل بحمض الهيدروليك المركز من المخبار الذي يحتوي على محلول الأمونيا"
      ],
      "conclusion": [
        ".تتكون سحب بيضاء من مركب كلوريد الألومنيوم نتيجة الاتحاد المباشر بين غاز النشادر NH three (وهو محلول الأمونيا) وحمض الهيدروكلوريك HCL",
      ],
      "img": "assets/main/exp11.png",
      "exp": "exp11"
    },
    {
      "id": 12,
      "name": "اكتشاف الخواص الكيميائية للافلزات",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك تكتشف الخواص الكيميائية للافلزات وتأثيرها على ورق عباد الشمس الزرقاء",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "قطعتين فحم",
        "أنبوبتان اختبار",
        "قطعة كبريت",
        "حمض هيدروليك مخفف",
        "ملعقة احتراق",
        "مخبار مملوء بغاز الأكسجين",
        "ورقة عباد شمس زرقاء"
      ],
      "steps": [
        "ضع قطعة فحم فى أنبوبة اختبار",
        "أضف إليها حمض الهيدروكلوريك المخفف",
        "كرر الخطوات السابقة مع الكبريت",
        "سخن قطعة الفحم الأخرى فى أنبوبة الإحتراق حتى تشتعل",
        "ضعها فى مخبار الأكسجين ",
        "أضف مقدار من الماء إلى المخبار مع الرج",
        "حرك ورقة عباد شمس زرقاء على الحمض الناتج",
      ],
      "conclusion": [
        ".مش بيحصل تفاعل بين الكربون والكبريت والحمض",
        ". بتتفاعل قطعةالفحم من الاكسجين ويتصاعد غاز، ويذوب في الماء",
        ". لا تتفاعل اللافلزات مع الأحماض المخففة",
        ".بتتفاعل اللافلزات مع الأكسجين وينتج أكاسيد حامضية تحمر ورقة عباد الشمس الزرقاء"
      ],
      "img": "assets/main/exp12.png",
      "exp": "exp12"
    },
    {
      "id": 13,
      "name": "مفهوم تلوث المياه",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك أن تتعرف على مفهوم تلوث المياه",
        "وكيف حصل تلوث الماء من خلال تأثير دا على درجة نمو الطحالب الخضراء",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاثة أوانى زجاجية",
        "ماء صنبور",
        "منظف صناعي سائل",
        "سماد زراعي",
        "ماء يحتوي على طحالب خضراء"
      ],
      "steps": [
        "املأ الأونى الزجاجية بماء الصنبور",
        "أضف إليها مقدار من الماء الأخضر",
        "أضف إلى الكأس الأول ملعقتين من المنظف الصناعى",
        "أضف إلى الكأس الثانى ملعقتين من السماد الزراعى",
        "اترك الكأس الثالث بدون إضافات"
      ],
      "conclusion": [
        ".نمو الطحالب بيكون أسرع في الكأس الملوث بالأسمدة الزراعية",
        ".نمو الطحالب بطيء في الكأس الملوث بالمنظف الصناعي",
        ".تلوث المياه بالمنظف الصناعي يؤدى إلى النمو البطيء للطحالب الخضراء هو إللي بيقلل من كمية الغذاء المتاحة للأسماك"
      ],
      "img": "assets/main/exp13.png",
      "exp": "exp13"
    }
    ,
    {
      "id": 14,
      "name": "قياس الضغط الجوي المعتاد",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك تقيس الضغط الجوي المعتاد",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "حوض زجاجي",
        "زئبق",
        "مسطرة طولها متر",
        "انبوبة طولها متر ومساحة مقطعها 1 سم مربع",
        "قمع",
        "غطاء"
      ],
      "steps":
        [
          "املأ الحوض الى منتصفه بالزئبق",
          "املأ الأنبوبة الى حافتها بالزئبق وغطها بالغطاء",
          "اقلب الأنبوبة فى حوض الزئبق ثم ارفع الغطاء",
          "استخدم المسطرة لقياس طول الزئبق في الأنبوبة"
        ]
      ,
      "conclusion": [
        ".طول عمود الزئبق يصل الى 76 سم",
        ".الضغط الجوي المعتاد يساوى وزن عمود من الزئبق مساحة مقطعه 1 سم وارتفاعه 76 سم",
      ],
      "img": "assets/main/exp14.png",
      "exp": "exp14"
    },
    {
      "id": 15,
      "name": "الضوء يسير في خطوط مستقيمة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح أن الضوء يسير في خطوط مستقيمة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاثة حوائل من الكرتون",
        "ثقب صغير في منتصف كل حائل",
        "شمعة (أو أي مصدر ضوئي)"
      ],
      "steps": [
        "الخطوة الأولى: ضع الحوائل الثلاثة على استقامة واحدة أمام الشمعة",
        "الخطوة الثانية: انظر إلى ضوء الشمعة خلال ثقب الحائل القريب منك",
        "الخطوة الثالثة: اضبط وضع الحوائل بتحريكها يمينًا أو يسارًا إلى أن تشاهد ضوء الشمعة مع خلال الثقوب الثلاثة",
        "الخطوة الرابعة: حرك أحد الحوائل يميناً أو يساراً"
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp15"
    }
  ]

  data1 = [
    {
      "id": 16,
      "name": "الضوء يسير في خطوط مستقيمة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح أن الضوء يسير في خطوط مستقيمة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاثة حوائل من الكرتون",
        "ثقب صغير في منتصف كل حائل",
        "شمعة (أو أي مصدر ضوئي)"
      ],
      "steps": [
        "الخطوة الأولى: ضع الحوائل الثلاثة على استقامة واحدة أمام الشمعة",
        "الخطوة الثانية: انظر إلى ضوء الشمعة خلال ثقب الحائل القريب منك",
        "الخطوة الثالثة: اضبط وضع الحوائل بتحريكها يمينًا أو يسارًا إلى أن تشاهد ضوء الشمعة مع خلال الثقوب الثلاثة",
        "الخطوة الرابعة: حرك أحد الحوائل يميناً أو يساراً"
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp16"
    },
  ]
  data2 = [
    {
      "id": 17,
      "name": "الضوء يسير في خطوط مستقيمة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح أن الضوء يسير في خطوط مستقيمة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاثة حوائل من الكرتون",
        "ثقب صغير في منتصف كل حائل",
        "شمعة (أو أي مصدر ضوئي)"
      ],
      "steps": [
        "الخطوة الأولى: ضع الحوائل الثلاثة على استقامة واحدة أمام الشمعة",
        "الخطوة الثانية: انظر إلى ضوء الشمعة خلال ثقب الحائل القريب منك",
        "الخطوة الثالثة: اضبط وضع الحوائل بتحريكها يمينًا أو يسارًا إلى أن تشاهد ضوء الشمعة مع خلال الثقوب الثلاثة",
        "الخطوة الرابعة: حرك أحد الحوائل يميناً أو يساراً"
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp17"
    },
  ]
  data3 = [
    {
      "id": 16,
      "name": "الضوء يسير في خطوط مستقيمة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح أن الضوء يسير في خطوط مستقيمة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاثة حوائل من الكرتون",
        "ثقب صغير في منتصف كل حائل",
        "شمعة (أو أي مصدر ضوئي)"
      ],
      "steps": [
        "الخطوة الأولى: ضع الحوائل الثلاثة على استقامة واحدة أمام الشمعة",
        "الخطوة الثانية: انظر إلى ضوء الشمعة خلال ثقب الحائل القريب منك",
        "الخطوة الثالثة: اضبط وضع الحوائل بتحريكها يمينًا أو يسارًا إلى أن تشاهد ضوء الشمعة مع خلال الثقوب الثلاثة",
        "الخطوة الرابعة: حرك أحد الحوائل يميناً أو يساراً"
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp15"
    },
  ]
  data5 = [
    {
      "id": 16,
      "name": "الضوء يسير في خطوط مستقيمة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح أن الضوء يسير في خطوط مستقيمة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاثة حوائل من الكرتون",
        "ثقب صغير في منتصف كل حائل",
        "شمعة (أو أي مصدر ضوئي)"
      ],
      "steps": [
        "الخطوة الأولى: ضع الحوائل الثلاثة على استقامة واحدة أمام الشمعة",
        "الخطوة الثانية: انظر إلى ضوء الشمعة خلال ثقب الحائل القريب منك",
        "الخطوة الثالثة: اضبط وضع الحوائل بتحريكها يمينًا أو يسارًا إلى أن تشاهد ضوء الشمعة مع خلال الثقوب الثلاثة",
        "الخطوة الرابعة: حرك أحد الحوائل يميناً أو يساراً"
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp15"
    },
  ]
  data6 = [
    {
      "id": 16,
      "name": "الضوء يسير في خطوط مستقيمة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح أن الضوء يسير في خطوط مستقيمة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاثة حوائل من الكرتون",
        "ثقب صغير في منتصف كل حائل",
        "شمعة (أو أي مصدر ضوئي)"
      ],
      "steps": [
        "الخطوة الأولى: ضع الحوائل الثلاثة على استقامة واحدة أمام الشمعة",
        "الخطوة الثانية: انظر إلى ضوء الشمعة خلال ثقب الحائل القريب منك",
        "الخطوة الثالثة: اضبط وضع الحوائل بتحريكها يمينًا أو يسارًا إلى أن تشاهد ضوء الشمعة مع خلال الثقوب الثلاثة",
        "الخطوة الرابعة: حرك أحد الحوائل يميناً أو يساراً"
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp15"
    },
  ]
  data7 = [
    {
      "id": 16,
      "name": "أين ذهبت الكتلة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح أين ذهبت الكتلة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "شمعه",
        "ميزان حساس",
        "مصدر اشعال"
      ],
      "steps": [
        " الخطوة الأولى: نقوم بوضع الشمعه قبل الاشتعال علي الميزان ونسجل الوزن ",
        "الخطوة الثانية: نقوم باشعال الشمعه وتركها من ثلاث الي اربع دقائق",
        "الخطوة الثالثة: ثم نقوم باطفاء الشمعه ونضعها مرة اخري علي الميزان",
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp16"
    },
    {
      "id": 17,
      "name": "تطوير مهارات الملاحظة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين نطور مهارات الملاحظة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ماء",
        " حليب",
        "أعواد أذان",
        " فلفل اسود",
        " ماده جيلاتينيه",
        " صابون ",
      ],
      "steps": [
        " الخطوة الأولى: نقوم بوضع الفلفل الاسود في الماء  ",
        "الخطوة الثانية:نقوم بوضع عود الاذان في الصابون ثم نقوم بوضعه في الماء الذي يحتوي علي الفلفل الاسود ونلاحظ",
        "الخطوة الثالثة:  نضع المادة في الحليب",
        "الخطوة الرابعة: نقوم بوضع عود الاذان في الصابون ثم نقوم بوضعه في الحليب الذي يحتوي علي الماده ونلاحظ",
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp17"
    },
    {
      "id": 18,
      "name": "تعرف مصدر الماء",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين نعرف مصدر الماء",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ماء صنبور",
        " ماء مقطر",
        "ماء يحتوي علي املاح",
        "سائل تنظيف",
      ],
      "steps": [
        " الخطوة الأولى:  يضاف سائل التنظيف الي العينات الثلاث   ",
        "الخطوة الثانية: يرج كل عينه لمدة دقيقة",
        "الخطوة الثالثة:نقوم بقياس البخار المتكون في كل عينه ونسجل القياس",
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp18"
    },
    {
      "id": 19,
      "name": "كيف يمكنك ملاحظة التغير الكيميائى",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين نعرف مصدر الماء",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مخبار",
        "فلز الخارصين",
        "حمض HCI",
        "كبريت",
      ],
      "steps": [
        " الخطوة الأولى:  يضاف فلز الخارصين الي المخبار   ",
        "الخطوة الثانية: يضاف حمض HCI الي مخبار اخر ",
        "الخطوة الثالثة:نشعل الكبريت ونقربه من كل من المخبارين نلاحظ انه لا يحدث شئ",
        "الخطوة الرابعه:نضع حمض HCI الي فلز الخارصين بالتدريج ونضع سداده لتجميع الغاز نلاحظ سماع صوت فرقعه",
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp19"
    },
    {
      "id": 20,
      "name": "فصل الاصباغ",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين نعرف مصدر الماء",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "كأس به ماء",
        "ورق ترشيح",
        "جزء من ورقة ترشيح",
        "قلم حبر",
      ],
      "steps": [
        " الخطوة الأولى: نضع نقطة حبر في مركز ورقة الترشيح بالضغط بقوة علي الورقه بواسطه رأس ريشة القلم الحبر   ",
        "الخطوة الثانية: نستعمل مقص أو رأس القلم لعمل ثقب صغير في مركز بقعة الحبر ",
        "الخطوة الثالثة:استعمل ربع ورقة الترشيح لعمل فتيله تسحب الماء بحيث توضع نهاية الفتيلة في الثقب الموجود في ورقة الترشيح الدائريه",
        "الخطوة الرابعه:نضع حمض HCI الي فلز الخارصين بالتدريج ونضع سداده لتجميع الغاز نلاحظ سماع صوت فرقعه",
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp20"
    },
    {
      "id": 21,
      "name": "تحديد نواتج التفاعل الكيميائى",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين نعرف مصدر الماء",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "محلول نترات الفضه",
        "سلك نحاسي",
        " ورق ترشيح",
        "ساق زجاجية ",
        "قمع ",
        "دورق ",
        "موقد ",
        "أعواد أذن ",
      ],
      "steps": [
        " الخطوة الأولى:نقوم بلف النحاس بشكل لولبي ونهايته علي شكل خطاف ويعلق علي الساق الزجاجيه   ",
        "الخطوة الثانية:نضع الساق الزجاجيه علي الكأس الذي يحتوي علي نترات الفضه بحيث يكون النحاس ملامس لمحلول نترات الفضه ",
        "الخطوة الثالثه: بعد حدوث التفاعل نلاحظ تغير محلول نترات الفضه الي الازرق المخضر وذوبان جزءمن النحاس  ",
        "الخطوة الرابعه: نفصل المحلول الناتج عن طريق عملية الترشيح  ",
        "الخطوة الخامسه: نأخذ المجلول الناتج بعد عملية الترشيح ونضعه في كأس فارغه  ",
        "الخطوة السادسه: نضع عود الأذن في الكأس الذي يحتوي علي المحلول الناتج   ",
        "الخطوة السابعه: نقرب العود من موقد النار نلاحظ تغير لون النار الي اللون الاخضر   ",
      ],
      "conclusion": [
        ".بعد حدوث التفاعل نلاحظ تغير محلول نترات الفضه الي الازرق المخضر وذوبان جزءمن النحاس",
        ".تغير لون النار الي اللون الاخضر عند وضعها في محلول نترات النحاس الناتج من التفاعل وتقريبها من موقد النار",
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp21"
    },
    {
      "id": 22,
      "name": "كيف يمكن ملاحظة تأثير الشحنات الكهربائية",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن ملاحظة تأثير الشحنات الكهربائية",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مشط بلاستيكي",
        "قصاصات صغيرة من الورق",
        " ",
      ],
      "steps": [
        " الخطوة الأولى:نضع قصاصات الورق علي الطاوله",
        " الخطوة الثانية:ندلك المشط البلاستيكي بالشعر ",
        " الخطوة الثالثة: نقرب المشط من القصاصات الورقيه نلاحظ انجذاب الورق",
      ],
      "conclusion": [
        ".بعد حدوث التفاعل نلاحظ تغير محلول نترات الفضه الي الازرق المخضر وذوبان جزءمن النحاس",
        ".تغير لون النار الي اللون الاخضر عند وضعها في محلول نترات النحاس الناتج من التفاعل وتقريبها من موقد النار",
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp22"
    },
    {
      "id": 23,
      "name": "نمذجة النظائر",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن نمذجة النظائر",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        " كأس يحتوي علي مجموعه من الكرات مختلفة الالوان",
      ],
      "steps": [
        " الخطوة الأولى:احصل علي كرات من النوع نفسه ولكنها مختلفة الالوان",
        " الخطوة الثانية:صنف الكرات حسب ألوانها  ",
        " الخطوة الثالثة:العدد الكلي 30",
        " الخطوة الثالثة:العدد لكل مجموعه 10",
        " الخطوة الرابعه:باستخدام الميزان حدد كتلة 10 كرات من كل مجموعه",
        " الخطوة الخامسه:متوسط الكتلة= الكتلة / 10",
        " الخطوة السادسة:احسب نسبة وجوده = عدد الكرات كل مجموعه * 100 / 30",
        " الخطوة السابعه:حدد الكتلة الذرية للكرات = متوسط الكتلة * نسبة وجود النظير",
      ],
      "conclusion": [
       "مهل تختلف الكتلة الذريه اذا حصلت علي كيس اخر يحتوي علي عددمختلف من النوع نفسه",
       "فسر لماذا تم تحديدمتوسط كتلة كل مجموعة من الكرات بقياس كتلة 10 حبات بدلا من حبه واحده؟"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp23"
    },
    {
      "id": 24,
      "name": "كيف نستدل على حدوث تغير كيميائي",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن ملاحظة تأثير الشحنات الكهربائية",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مشط بلاستيكي",
        "قصاصات صغيرة من الورق",
        " ",
      ],
      "steps": [
        " الخطوة الأولى:نضع قصاصات الورق علي الطاوله",
        " الخطوة الثانية:ندلك المشط البلاستيكي بالشعر ",
        " الخطوة الثالثة: نقرب المشط من القصاصات الورقيه نلاحظ انجذاب الورق",
      ],
      "conclusion": [
        ".بعد حدوث التفاعل نلاحظ تغير محلول نترات الفضه الي الازرق المخضر وذوبان جزءمن النحاس",
        ".تغير لون النار الي اللون الاخضر عند وضعها في محلول نترات النحاس الناتج من التفاعل وتقريبها من موقد النار",
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp24"
    },
    {
      "id": 25,
      "name": "لاحظ تفاعلاً يكون راسب",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن ملاحظة تأثير الشحنات الكهربائية",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مشط بلاستيكي",
        "قصاصات صغيرة من الورق",
        " ",
      ],
      "steps": [
        " الخطوة الأولى:نضع قصاصات الورق علي الطاوله",
        " الخطوة الثانية:ندلك المشط البلاستيكي بالشعر ",
        " الخطوة الثالثة: نقرب المشط من القصاصات الورقيه نلاحظ انجذاب الورق",
      ],
      "conclusion": [
        ".بعد حدوث التفاعل نلاحظ تغير محلول نترات الفضه الي الازرق المخضر وذوبان جزءمن النحاس",
        ".تغير لون النار الي اللون الاخضر عند وضعها في محلول نترات النحاس الناتج من التفاعل وتقريبها من موقد النار",
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp25"
    },
    {
      "id": 26,
      "name": "تطوير سلسلة نشاط الفلزات",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن ملاحظة تأثير الشحنات الكهربائية",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مشط بلاستيكي",
        "قصاصات صغيرة من الورق",
        " ",
      ],
      "steps": [
        " الخطوة الأولى:نضع قصاصات الورق علي الطاوله",
        " الخطوة الثانية:ندلك المشط البلاستيكي بالشعر ",
        " الخطوة الثالثة: نقرب المشط من القصاصات الورقيه نلاحظ انجذاب الورق",
      ],
      "conclusion": [
        ".بعد حدوث التفاعل نلاحظ تغير محلول نترات الفضه الي الازرق المخضر وذوبان جزءمن النحاس",
        ".تغير لون النار الي اللون الاخضر عند وضعها في محلول نترات النحاس الناتج من التفاعل وتقريبها من موقد النار",
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp26"
    },
    {
      "id": 27,
      "name": "نمذجة الكتلة الذرية",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن نمذجة الكتلة الذرية",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        " كأس يحتوي علي مجموعه من الكرات مختلفة الالوان",
      ],
      "steps": [
        " الخطوة الأولى:احصل علي كرات من النوع نفسه ولكنها مختلفة الالوان",
        " الخطوة الثانية:صنف الكرات حسب ألوانها  ",
        " الخطوة الثالثة:العدد الكلي 30",
        " الخطوة الثالثة:العدد لكل مجموعه 10",
        " الخطوة الرابعه:باستخدام الميزان حدد كتلة 10 كرات من كل مجموعه",
        " الخطوة الخامسه:متوسط الكتلة= الكتلة / 10",
        " الخطوة السادسة:احسب نسبة وجوده = عدد الكرات كل مجموعه * 100 / 30",
        " الخطوة السابعه:حدد الكتلة الذرية للكرات = متوسط الكتلة * نسبة وجود النظير",
      ],
      "conclusion": [
       "مهل تختلف الكتلة الذريه اذا حصلت علي كيس اخر يحتوي علي عددمختلف من النوع نفسه",
       "فسر لماذا تم تحديدمتوسط كتلة كل مجموعة من الكرات بقياس كتلة 10 حبات بدلا من حبه واحده؟"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp27"
    },
    {
      "id": 28,
      "name": "ما مقدار المول",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن نمذجة الكتلة الذرية",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ميزان حساس",
        "ورقة دفتر لكتابة الملاحظات",
        "مخبار مدرج",
        "بازلاء مفلوقه"
      ],
      "steps": [
        "الخطوة الاولي: نقيس كتلة المخبار المدرج فارغ ونسجلها",
        "الخطوة الثانيه: نضع 25 فلقه من البازلاء في المخبار المدرج",
        " الخطوة الثالثة: نقيس كتلة 25حبة من البازلاءوالمخبار معاو نسجلها",
        "الخطوة الرابعه: نملئ المخبار بحبات البازلاء الي مقياس 100ملم",
        " الخطوة الخامسه: نقيس كتلة حبات البازلاءوالمخبار معاو نسجلها",
      ],
      "conclusion": [

      ],
      "img": "assets/main/exp15.png",
      "exp": "exp28"
    },
    {
      "id": 29,
      "name": "تحليل العلك",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن تحليل العلك",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "مخبار مدرج x2",
        "كأس زجاجية X2",
        "عصا للتحريك",
        " سكين",
        "ساعة ايقاف",
        "علكة",
        "ماء مقطر",
        "ورق ترشيح",
        "ميزان"
      ],
      "steps": [
        "الخطوة الاولي: نقوم بكشط سطح قطعتين من العلك لازالة الطبقة الخارجية",
        "الخطوة الثانيه: باستخدام ورق الترشيح والميزان نقيس الكتلة الابتدائيه للقطعتين",
        " الخطوة الثالثة: نقيس كتلة 25حبة من البازلاءوالمخبار معاو نسجلها",
        "الخطوة الرابعه: نملئ المخبار بحبات البازلاء الي مقياس 100ملم",
        " الخطوة الخامسه: نقيس كتلة حبات البازلاءوالمخبار معاو نسجلها",
      ],
      "conclusion": [

      ],
      "img": "assets/main/exp15.png",
      "exp": "exp29"
    },
    {
      "id": 30,
      "name": "تحديد صيغة الاملاح",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزين كيف يمكن تحديد صيغة الاملاح",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "بوتقة ذات غطاء",
        "كبريتات النحاس الثنائيه المائيه",
        "ملقط",
        "ساعة ايقاف",
        "ورق ترشيح",
        "ميزان",
        "سخان"
      ],
      "steps": [
        "الخطوة الاولي: نقيس كتلة البوتقة وغطائها",
        "الخطوة الثانيه:نقيس 3 جرام من كبريتات النحاس الثنائيه ونضعها في البوتقه",
        " الخطوة الثالثة: نقيس كتلة البوتقة وغطائها مع كبريتات النحاس",
        "الخطوة الرابعه:نقوم بالتسخين بدرجة حرارة منخفضه ثم نزيدها تدريجيا",
        " الخطوة الخامسه:نرفع البوتقة عن السخان باستخدام الملقط",
        " الخطوة السادسة:نقيس الكتلة النهائيه للبوتقة بعد التسخسن",
      ],
      "conclusion": [

      ],
      "img": "assets/main/exp15.png",
      "exp": "exp30"
    },
    {
      "id": 31,
      "name": "تحديد ماهية المركبات",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح تحديد ماهية المركبات",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "أعواد قطنية",
        "Kcl",
        "NaCl",
        "CuSo4",
        "Bacl2",
        "لهب"
      ],
      "steps": [
        "لهب+kcl=لون بنفسجي",
        "لهب+cuso4=لون أخضر",
        "لهب+Bacl2=لون أخضر فاتح",
        "لهب+NaCl=لون أصفر",
      ],
      "conclusion": [
        "لأن الألوان تنتج عن انتقال الالكتروناتلذرات الفلزات والالوان من خصائص الفلزات",
        "(صوديوم وكالسيوم وبوتاسيوم)"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp31"
    },
    {
      "id": 32,
      "name": "كيف تتمكن من تعرف أنماط التغير في الخواص",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح كيف تتمكن من تعرف أنماط التغير في الخواص",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاث مسامير",
        "مسطرة",
        "ميزان",
        "ورقه تدوين النتائج",
      ],
      "steps": [
        "قياس طول كل مسمار من المسامير الثلاثة",
        "قياس كتلة كل مسمار بالميزان",
        "رتب المسامير تصاعديا من جيث الطول والكتله وفق شكلها"
      ],
      "conclusion": [
        ""
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp32"
    },
    // {
    //   "id": 33,
    //   "name": "رتب العناصر",
    //   "intro": [
    //     "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح كيف ترتب العناصر",
    //     "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
    //   ], "tools": [
    //     "ثلاث مسامير",
    //     "مسطرة",
    //     "ميزان",
    //     "ورقه تدوين النتائج",
    //   ],
    //   "steps": [
    //     "قياس طول كل مسمار من المسامير الثلاثة",
    //     "قياس كتلة كل مسمار بالميزان",
    //     "رتب المسامير تصاعديا من جيث الطول والكتله وفق شكلها"
    //   ],
    //   "conclusion": [
    //     ""
    //   ],
    //   "img": "assets/main/exp15.png",
    //   "exp": "exp33"
    // },
    // {
    //   "id": 34,
    //   "name": "الكيمياء الوصفية ( النوعية )",
    //   "intro": [
    //     "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح الكيمياء الوصفية ( النوعية )",
    //     "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
    //   ], "tools": [
    //     "ثلاث مسامير",
    //     "مسطرة",
    //     "ميزان",
    //     "ورقه تدوين النتائج",
    //   ],
    //   "steps": [
    //     "قياس طول كل مسمار من المسامير الثلاثة",
    //     "قياس كتلة كل مسمار بالميزان",
    //     "رتب المسامير تصاعديا من جيث الطول والكتله وفق شكلها"
    //   ],
    //   "conclusion": [
    //     ""
    //   ],
    //   "img": "assets/main/exp15.png",
    //   "exp": "exp34"
    // },
  ]

  data8 = [
    {
      "id": 31,
      "name": "تحديد ماهية المركبات",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح تحديد ماهية المركبات",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "أعواد قطنية",
        "Kcl",
        "NaCl",
        "CuSo4",
        "Bacl2",
        "لهب"
      ],
      "steps": [
        "لهب+kcl=لون بنفسجي",
        "لهب+cuso4=لون أخضر",
        "لهب+Bacl2=لون أخضر فاتح",
        "لهب+NaCl=لون أصفر",
      ],
      "conclusion": [
        "لأن الألوان تنتج عن انتقال الالكتروناتلذرات الفلزات والالوان من خصائص الفلزات",
        "(صوديوم وكالسيوم وبوتاسيوم)"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp31"
    },
  ]
  data9 = [
    {
      "id": 16,
      "name": "الضوء يسير في خطوط مستقيمة",
      "intro": [
        "أنت دلوقتي في معمل العلوم الافتراضي، وعاوزينك توضح أن الضوء يسير في خطوط مستقيمة",
        "يلا اضغط جرب بنفسك عشان تبدأ التجربة"
      ], "tools": [
        "ثلاثة حوائل من الكرتون",
        "ثقب صغير في منتصف كل حائل",
        "شمعة (أو أي مصدر ضوئي)"
      ],
      "steps": [
        "الخطوة الأولى: ضع الحوائل الثلاثة على استقامة واحدة أمام الشمعة",
        "الخطوة الثانية: انظر إلى ضوء الشمعة خلال ثقب الحائل القريب منك",
        "الخطوة الثالثة: اضبط وضع الحوائل بتحريكها يمينًا أو يسارًا إلى أن تشاهد ضوء الشمعة مع خلال الثقوب الثلاثة",
        "الخطوة الرابعة: حرك أحد الحوائل يميناً أو يساراً"
      ],
      "conclusion": [
        ".يمكن رؤية ضوء الشمعة لما تكون الثقوب على استقامة واحدة مع ضوء الشمعة",
        ".لا يمكن رؤية ضوء الشمعة عند تحريك أحد الحوائل يمين أو شمال",
        ".الضوء يسير في خطوط مستقيمة"
      ],
      "img": "assets/main/exp15.png",
      "exp": "exp15"
    },
  ]


  constructor() { }

  GetAll() {
    let items = [];
    this.data.forEach(element => {
      items.push({ 'id': element.id, 'name': element.name, "img": element.img });
    });

    return items;
  }

  Get(experimentId) {
    let material = parseInt(localStorage.getItem('material'))
    switch (material) {
      case 1:
        return this.data1.find(e => { return e.id == experimentId })
        break;
      case 2:
        return this.data2.find(e => { return e.id == experimentId })
        break;
      case 3:
        return this.data3.find(e => { return e.id == experimentId })
        break;
      case 4:
        return this.data.find(e => { return e.id == experimentId })
        break;
      case 5:
        return this.data5.find(e => { return e.id == experimentId })
        break;
      case 6:
        return this.data6.find(e => { return e.id == experimentId })
        break;
      case 7:
        return this.data7.find(e => { return e.id == experimentId })
        break;
      case 8:
        return this.data8.find(e => { return e.id == experimentId })
        break;
      case 9:
        return this.data9.find(e => { return e.id == experimentId })
        break;

      default:
        break;
    }
    // return this.data.find(e => { return e.id == experimentId })
  }
}
